# Series

In [1]:
import pandas as pd

In [8]:
# 리스트로 시리즈 생성
data = [1, 2, 3, 4, 5]
s1=pd.Series(data)
print(s1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
# 인덱스 지정하여 시리즈 생성
data = [1, 2, 3, 4, 5]
index = ['a', 'b', 'c', 'd', 'e']
s2 = pd.Series(data, index=index)
print(s2)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [32]:
# 딕셔너리로 시리즈 생성 - 키가 인덱스가 됨
ser = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(ser)
print(s3)

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
population = pd.Series([9776, 2729, 1566, 3158], 
                    index=['서울', '부산', '인천', '대구'])
print(population['서울'])  # 9776 출력
print(population[['서울', '부산']])  # 서울과 부산의 데이터만 선택

9776
서울    9776
부산    2729
dtype: int64

In [ ]:
ser2=pd.Series([10,'banana'])
type(ser2),ser2 # 문자 있어서 문자형으로 데이터타입 바뀜

(pandas.core.series.Series,
 0        10
 1    banana
 dtype: object)

In [16]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [34]:

s3.iloc[0],s3.loc['a']

(np.int64(1), np.int64(1))

# DataFrame

In [36]:
# 리스트로 데이터프레임 생성
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

# 열 이름 지정하여 생성
df = pd.DataFrame(data, columns=['A', 'B', 'C'])
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [38]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [40]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [43]:
scientists.loc[0]

Name          Rosaline Franklin
Occupation              Chemist
Born                 1920-07-25
Died                 1958-04-16
Age                          37
Name: 0, dtype: object

In [45]:
scientists.index=['Rosaline Franklin','William Gosset']

In [47]:
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [48]:
scientists.iloc[1]

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [54]:
scientists.index=[1,2]
scientists['Name']

1    Rosaline Franklin
2       William Gosset
Name: Name, dtype: object

In [55]:
data = [[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]]

df = pd.DataFrame(data)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [56]:
df[1]

0    2
1    5
2    8
Name: 1, dtype: int64

In [57]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

In [58]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [61]:
sci1.loc[0,'Name']

'Rosaline Franklin'

In [62]:
sci1.loc[1,'Occupation']

'Statistician'

# 데이터의 저장과 불러오기

In [63]:
sci1.to_csv('./data/scientist_1.csv')

In [64]:
sci1.to_csv('./data/scientist_2.csv', index=False)

In [66]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [75]:
scip=pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset", 'Florence Nightingale','Marie Curie','Rachel Carson'],
        "Occupation": ["Chemist", "Statistician",'Nurse','Chemist', 'Biologist'],
        "Born": ["1920-07-25", "1876-06-13",'1820-05-12','1867-11-07', '1907-05-27'],
        "Died": ["1958-04-16", "1937-10-16",'1910-08-13', '1934-07-04', '1964-04-14'],
        "Age": [37, 61,90,66,56],
})
scip.to_csv('./data/scientists.csv', index=False)

In [71]:
# pickle: 파이썬의 객체형을 저장
sci1.to_pickle('./data/scientist_2.pickle')

In [72]:
df2=pd.read_pickle('./data/scientist_2.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [76]:
a1=pd.read_csv('./data/scientists.csv')
a1

                   Name    Occupation        Born        Died  Age
0     Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1        William Gosset  Statistician  1876-06-13  1937-10-16   61
2  Florence Nightingale         Nurse  1820-05-12  1910-08-13   90
3           Marie Curie       Chemist  1867-11-07  1934-07-04   66
4         Rachel Carson     Biologist  1907-05-27  1964-04-14   56

In [2]:
import pandas as pd

In [4]:
scip=pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset", 'Florence Nightingale','Marie Curie','Rachel Carson'],
        "Occupation": ["Chemist", "Statistician",'Nurse','Chemist', 'Biologist'],
        "Born": ["1920-07-25", "1876-06-13",'1820-05-12','1867-11-07', '1907-05-27'],
        "Died": ["1958-04-16", "1937-10-16",'1910-08-13', '1934-07-04', '1964-04-14'],
        "Age": [37, 61,90,66,56],
})
scip

                   Name    Occupation        Born        Died  Age
0     Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1        William Gosset  Statistician  1876-06-13  1937-10-16   61
2  Florence Nightingale         Nurse  1820-05-12  1910-08-13   90
3           Marie Curie       Chemist  1867-11-07  1934-07-04   66
4         Rachel Carson     Biologist  1907-05-27  1964-04-14   56

In [6]:
scip.iloc[1,4]

np.int64(61)

# 데이터 미리보기
info()
head()/tail()

In [ ]:
a1.head(3) #default=5 지정 없을 시

                   Name    Occupation        Born        Died  Age
0     Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1        William Gosset  Statistician  1876-06-13  1937-10-16   61
2  Florence Nightingale         Nurse  1820-05-12  1910-08-13   90

In [80]:
a1.tail(2)

            Name Occupation        Born        Died  Age
3    Marie Curie    Chemist  1867-11-07  1934-07-04   66
4  Rachel Carson  Biologist  1907-05-27  1964-04-14   56

In [83]:
a1.describe()

             Age
count   5.000000
mean   62.000000
std    19.118054
min    37.000000
25%    56.000000
50%    61.000000
75%    66.000000
max    90.000000

In [84]:
a1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Occupation  5 non-null      object
 2   Born        5 non-null      object
 3   Died        5 non-null      object
 4   Age         5 non-null      int64
dtypes: int64(1), object(4)
memory usage: 332.0+ bytes

In [86]:
a1['Age'].describe()

count     5.000000
mean     62.000000
std      19.118054
min      37.000000
25%      56.000000
50%      61.000000
75%      66.000000
max      90.000000
Name: Age, dtype: float64

In [90]:
a1.loc[:, 'Age'].describe()

count     5.000000
mean     62.000000
std      19.118054
min      37.000000
25%      56.000000
50%      61.000000
75%      66.000000
max      90.000000
Name: Age, dtype: float64

In [92]:
import pandas as pd

# 샘플 데이터프레임 생성
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

# 처음 5개 행 보기
print("=== head() ===")
print(df.head())

# 마지막 3개 행 보기
print("\n=== tail(3) ===")
print(df.tail(3))

# 데이터프레임 기본 정보
print("\n=== info() ===")
print(df.info())

# 기술 통계량
print("\n=== describe() ===")
print(df.describe())

=== head() ===
    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88

=== tail(3) ===
    이름  나이  점수
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

=== info() ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes
None

=== describe() ===
              나이         점수
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [93]:
df.columns = ['name', 'age', 'score']

In [94]:
print(df.columns)

Index(['name', 'age', 'score'], dtype='object')

In [95]:
df.index = ['A', 'B', 'C', 'D', 'E', 'F', 'G']
print(df.index)

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')

In [96]:
print("=== head() ===")
print(df.head())

# 마지막 3개 행 보기
print("\n=== tail(3) ===")
print(df.tail(3))

# 데이터프레임 기본 정보
print("\n=== info() ===")
print(df.info())

# 기술 통계량
print("\n=== describe() ===")
print(df.describe())

=== head() ===
  name  age  score
A  김철수   25     85
B  이영희   28     92
C  박민수   22     78
D  정수진   31     95
E  최영호   27     88

=== tail(3) ===
  name  age  score
E  최영호   27     88
F  한미래   24     73
G  윤지원   29     91

=== info() ===
<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, A to G
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int64
 2   score   7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes
None

=== describe() ===
             age      score
count   7.000000   7.000000
mean   26.571429  86.000000
std     3.101459   7.958224
min    22.000000  73.000000
25%    24.500000  81.500000
50%    27.000000  88.000000
75%    28.500000  91.500000
max    31.000000  95.000000

In [2]:
import pandas as pd
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)

In [3]:
df.info()
df.columns = ['name', 'age', 'score']

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [4]:
df.rename(columns={'name':'Name'})

  Name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [5]:
df.rename(index={0:'a'}, inplace=True) # inplace는 True 시 원본을 바꿈(기본은False)
df

  name  age  score
a  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

# Gapminder를 읽어 데이터프레임 만들기

In [51]:
gm = pd.read_csv('./data/gapminder.tsv', sep='\t')
gm

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

## country 열 추출하기

In [105]:
gapminder['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

## 나라,대륙,년도 열 추출하기

In [121]:
gapminder.loc[:,('country','continent','year')]
#gapminder.iloc[:, :3]

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

## [0], [99] , [-1] 행을 각각 추출하기

In [ ]:
# gapminder.iloc[0]
# gapminder.iloc[99]
# gapminder.iloc[-1]
gm_list=gapminder.iloc[[0,99,-1]]
gm_list

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
99     Bangladesh      Asia  1967   43.453  62821884  721.186086
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [120]:
gapminder.iloc[:, :3]

          country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

## 연도와 인구 10건 > 슬라이싱 > 서브셋

In [ ]:
gm['year,'pop]

## 인구당 gdp 마지막 10개 값 추출

## range() 객체로 행/열 슬라이싱

# 행,열 추가

In [6]:
# loc를 사용하여 새로운 행 추가
df.loc['H'] = ['장민호', 26, 88]

In [7]:
df.iloc[0:2] #행단위는 iloc,이름단위는 loc

  name  age  score
a  김철수   25     85
1  이영희   28     92

In [8]:
df[df['나이']>25] #조건을 사용한 행 추출

KeyError: '나이'

In [25]:
df[df['점수']>=90]

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
6  윤지원  29  91

In [9]:
df.loc[7]=['홍길동', 30,70]

In [10]:
df['grade'] = ['A', 'B', 'A', 'A', 'B', 'C', 'A', 'A', 'C']

In [ ]:
df.columns

    이름  나이  점수 grade
0  김철수  25  85     A
1  이영희  28  92     B
2  박민수  22  78     A
3  정수진  31  95     A
4  최영호  27  88     B
5  한미래  24  73     C
6  윤지원  29  91     A
H  장민호  26  88     A
7  홍길동  30  70     C

In [11]:
df.rename(columns={'grade':'등급'},inplace=True)
df

  name  age  score 등급
a  김철수   25     85  A
1  이영희   28     92  B
2  박민수   22     78  A
3  정수진   31     95  A
4  최영호   27     88  B
5  한미래   24     73  C
6  윤지원   29     91  A
H  장민호   26     88  A
7  홍길동   30     70  C

In [26]:
# 열삽일할대는 insert/ 행 삽입시에는 그냥 lco , 또는 concat
df.insert(loc=1, column='s_id', value=['S001', 'S002', 'S003', 'S004', 'S005', 'S006', 'S007', 'S008', 'S009'])

ValueError: cannot insert s_id, already exists

In [45]:
df

    이름  s_id  나이  점수 등급
0  김철수  S001  25  85  A
1  이영희  S002  28  92  B
2  박민수  S003  22  78  A
3  정수진  S004  31  95  A
4  최영호  S005  27  88  B
5  한미래  S006  24  73  C
6  윤지원  S007  29  91  A
H  장민호  S008  26  88  A
7  홍길동  S009  30  70  C

In [13]:
df.drop('s_id', axis=1) # 역시 안에 inplace 넣을시 원본이 바뀜

  name  age  score 등급
a  김철수   25     85  A
1  이영희   28     92  B
2  박민수   22     78  A
3  정수진   31     95  A
4  최영호   27     88  B
5  한미래   24     73  C
6  윤지원   29     91  A
H  장민호   26     88  A
7  홍길동   30     70  C

In [14]:
df.drop('H',axis=0,inplace=True)

In [16]:
df

  name  s_id  age  score 등급
a  김철수  S001   25     85  A
1  이영희  S002   28     92  B
2  박민수  S003   22     78  A
3  정수진  S004   31     95  A
4  최영호  S005   27     88  B
5  한미래  S006   24     73  C
6  윤지원  S007   29     91  A
7  홍길동  S008   30     70  C

In [15]:
df.iloc[7,1]='S008'

In [53]:
df

    이름  s_id  나이  점수 등급
0  김철수  S001  25  85  A
1  이영희  S002  28  92  B
2  박민수  S003  22  78  A
3  정수진  S004  31  95  A
4  최영호  S005  27  88  B
5  한미래  S006  24  73  C
6  윤지원  S007  29  91  A
7  홍길동  S008  30  70  C

In [17]:
df.drop(columns='등급')

  name  s_id  age  score
a  김철수  S001   25     85
1  이영희  S002   28     92
2  박민수  S003   22     78
3  정수진  S004   31     95
4  최영호  S005   27     88
5  한미래  S006   24     73
6  윤지원  S007   29     91
7  홍길동  S008   30     70

In [57]:
df

    이름  s_id  나이  점수 등급
0  김철수  S001  25  85  A
1  이영희  S002  28  92  B
2  박민수  S003  22  78  A
3  정수진  S004  31  95  A
4  최영호  S005  27  88  B
5  한미래  S006  24  73  C
6  윤지원  S007  29  91  A
7  홍길동  S008  30  70  C

In [18]:
df.iloc[0,4]='B'
df.iloc[1,4]='A'
df.iloc[2,4]='C'

In [21]:
df

  name  s_id  age  score 등급
a  김철수  S001   25     85  B
1  이영희  S002   28     92  A
2  박민수  S003   22     78  C
3  정수진  S004   31     95  A
4  최영호  S005   27     88  B
5  한미래  S006   24     73  C
6  윤지원  S007   29     91  A
7  홍길동  S008   30     70  C

In [63]:
df.drop(columns=df.columns[1])

    이름  나이  점수 등급
0  김철수  25  85  B
1  이영희  28  92  A
2  박민수  22  78  C
3  정수진  31  95  A
4  최영호  27  88  B
5  한미래  24  73  C
6  윤지원  29  91  A
7  홍길동  30  70  C

In [20]:
df.rename(columns={'점수':'등급'})
df

  name  s_id  age  score 등급
a  김철수  S001   25     85  B
1  이영희  S002   28     92  A
2  박민수  S003   22     78  C
3  정수진  S004   31     95  A
4  최영호  S005   27     88  B
5  한미래  S006   24     73  C
6  윤지원  S007   29     91  A
7  홍길동  S008   30     70  C

In [25]:
df = df.astype({'age': int, 'score': float})
df['s_id'] = df['s_id'].astype(str)

In [27]:
df_new=df.set_index('s_id')
df_new

     name  age  score 등급
s_id
S001  김철수   25   85.0  B
S002  이영희   28   92.0  A
S003  박민수   22   78.0  C
S004  정수진   31   95.0  A
S005  최영호   27   88.0  B
S006  한미래   24   73.0  C
S007  윤지원   29   91.0  A
S008  홍길동   30   70.0  C

In [29]:
df_new.reset_index(inplace=True)
df_new

   index  s_id name  age  score 등급
0      0  S001  김철수   25   85.0  B
1      1  S002  이영희   28   92.0  A
2      2  S003  박민수   22   78.0  C
3      3  S004  정수진   31   95.0  A
4      4  S005  최영호   27   88.0  B
5      5  S006  한미래   24   73.0  C
6      6  S007  윤지원   29   91.0  A
7      7  S008  홍길동   30   70.0  C

In [35]:
dr=pd.date_range('2025-06-01',periods=8,freq='d')
dr

DatetimeIndex(['2025-06-01', '2025-06-02', '2025-06-03', '2025-06-04',
               '2025-06-05', '2025-06-06', '2025-06-07', '2025-06-08'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
df_new ['date'] = dr
# 그냥 넣으면 열, loc로 넣으면 행으로 드러감

In [41]:
df_new.drop(columns='data',inplace=True)

In [42]:
df_new

   index  s_id name  age  score 등급       date
0      0  S001  김철수   25   85.0  B 2025-06-01
1      1  S002  이영희   28   92.0  A 2025-06-02
2      2  S003  박민수   22   78.0  C 2025-06-03
3      3  S004  정수진   31   95.0  A 2025-06-04
4      4  S005  최영호   27   88.0  B 2025-06-05
5      5  S006  한미래   24   73.0  C 2025-06-06
6      6  S007  윤지원   29   91.0  A 2025-06-07
7      7  S008  홍길동   30   70.0  C 2025-06-08

# Gapminder 추가연습

In [45]:
gm = pd.read_csv('./data/gapminder.tsv', sep='\t')
gm

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [46]:
gm.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [47]:
gm.shape

(1704, 6)